Revit 2027 API
RebarFreeFormValidationResult Enumeration
 Errors for the Free Form Rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarFreeFormValidationResult
Public Enumeration RebarFreeFormValidationResult
public enum class RebarFreeFormValidationResult
type RebarFreeFormValidationResult
Members
Member name | Value | Description
InvalidLoop | 4 |  Curves doesn't form a valid curve loop.
NullCurve | 2 |  One or more of the input curves was null.
RebarCantBeBent | 5 |  A rebar constructed from curves can't be bent according to the bending radius.
Success | 0 |  Operation was done with success.
UnboundCurve | 3 |  One or more of the input curves was unbounded.
Undefined | 1 |  An unexpected error occured.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace